import 'package:cloud_firestore/cloud_firestore.dart';
import 'package:firebase_core/firebase_core.dart';
import 'package:flutter/material.dart';

void main() async {
  WidgetsFlutterBinding.ensureInitialized();
  await Firebase.initializeApp();

  await uploadRegionSet();
  print("Region data upload completed.");
}

Future<void> uploadRegionSet() async {
  final regionData = {
    "seoul": {
      "name": "서울특별시",
      "areas": [
        "강남구",
        "강동구",
        "강북구",
        "강서구",
        "관악구",
        "광진구",
        "구로구",
        "금천구",
        "노원구",
        "도봉구",
        "동대문구",
        "동작구",
        "마포구",
        "서대문구",
        "서초구",
        "성동구",
        "성북구",
        "송파구",
        "양천구",
        "영등포구",
        "용산구",
        "은평구",
        "종로구",
        "중구",
        "중랑구"
      ]
    },
    "busan": {
      "name": "부산광역시",
      "areas": [
        "강서구",
        "금정구",
        "기장군",
        "남구",
        "동구",
        "동래구",
        "부산진구",
        "북구",
        "사상구",
        "사하구",
        "서구",
        "수영구",
        "연제구",
        "영도구",
        "중구",
        "해운대구"
      ]
    },
    "daegu": {
      "name": "대구광역시",
      "areas": [
        "남구",
        "달서구",
        "달성군",
        "동구",
        "북구",
        "서구",
        "수성구",
        "중구",
        "동촌동",
        "이곡동",
        "지산동",
        "대명동"
      ]
    },
    "incheon": {
      "name": "인천광역시",
      "areas": [
        "강화군",
        "계양구",
        "남동구",
        "동구",
        "미추홀구",
        "부평구",
        "서구",
        "연수구",
        "옹진군",
        "중구",
        "송도동",
        "청라동"
      ]
    },
    "gwangju": {
      "name": "광주광역시",
      "areas": [
        "광산구",
        "남구",
        "동구",
        "북구",
        "서구",
        "양림동",
        "상무지구",
        "첨단지구",
        "운암동",
        "금호동",
        "두암동",
        "유덕동"
      ]
    },
    "daejeon": {
      "name": "대전광역시",
      "areas": [
        "대덕구",
        "동구",
        "서구",
        "유성구",
        "중구",
        "온천동",
        "월평동",
        "가양동",
        "관저동",
        "둔산동",
        "신성동",
        "탄방동",
        "문화동",
        "은행동",
        "용운동",
        "신탄진동"
      ]
    },
    "ulsan": {
      "name": "울산광역시",
      "areas": [
        "남구",
        "동구",
        "북구",
        "울주군",
        "중구",
        "무거동",
        "삼산동",
        "달동",
        "야음동",
        "화봉동",
        "진장동",
        "약사동",
        "성남동",
        "방어진",
        "울산항",
        "온산읍",
        "서생면"
      ]
    },
    "sejong": {
      "name": "세종특별자치시",
      "areas": [
        "세종시",
        "조치원읍",
        "한솔동",
        "도담동",
        "아름동",
        "고운동",
        "종촌동",
        "소담동",
        "보람동",
        "대평동",
        "금남면",
        "전의면"
      ]
    },
    "gyeonggi-do": {
      "name": "경기도",
      "areas": [
        "가평군",
        "고양시",
        "과천시",
        "광명시",
        "광주시",
        "구리시",
        "군포시",
        "김포시",
        "남양주시",
        "동두천시",
        "부천시",
        "성남시",
        "수원시",
        "시흥시",
        "안산시",
        "안성시",
        "안양시",
        "양주시",
        "양평군",
        "여주시",
        "연천군",
        "오산시",
        "용인시",
        "의왕시",
        "의정부시",
        "이천시",
        "파주시",
        "평택시",
        "포천시",
        "하남시",
        "화성시"
      ]
    },
    "gangwon-do": {
      "name": "강원도",
      "areas": [
        "강릉시",
        "고성군",
        "동해시",
        "삼척시",
        "속초시",
        "양구군",
        "양양군",
        "영월군",
        "원주시",
        "인제군",
        "정선군",
        "철원군",
        "춘천시",
        "태백시",
        "평창군",
        "홍천군",
        "화천군",
        "횡성군"
      ]
    },
    "chungcheongbuk-do": {
      "name": "충청북도",
      "areas": [
        "괴산군",
        "단양군",
        "보은군",
        "영동군",
        "옥천군",
        "음성군",
        "제천시",
        "증평군",
        "진천군",
        "청주시",
        "충주시",
        "내수읍"
      ]
    },
    "chungcheongnam-do": {
      "name": "충청남도",
      "areas": [
        "계룡시",
        "공주시",
        "금산군",
        "논산시",
        "당진시",
        "보령시",
        "부여군",
        "서산시",
        "서천군",
        "아산시",
        "예산군",
        "천안시",
        "청양군",
        "태안군",
        "홍성군"
      ]
    },
    "jeollabuk-do": {
      "name": "전라북도",
      "areas": [
        "고창군",
        "군산시",
        "김제시",
        "남원시",
        "무주군",
        "부안군",
        "순창군",
        "완주군",
        "익산시",
        "임실군",
        "장수군",
        "전주시",
        "정읍시",
        "진안군"
      ]
    },
    "jeollanam-do": {
      "name": "전라남도",
      "areas": [
        "강진군",
        "고흥군",
        "곡성군",
        "광양시",
        "구례군",
        "나주시",
        "담양군",
        "목포시",
        "무안군",
        "보성군",
        "순천시",
        "신안군",
        "여수시",
        "영광군",
        "영암군",
        "완도군",
        "장성군",
        "장흥군",
        "진도군",
        "함평군",
        "해남군",
        "화순군"
      ]
    },
    "gyeongsangbuk-do": {
      "name": "경상북도",
      "areas": [
        "경산시",
        "경주시",
        "고령군",
        "구미시",
        "군위군",
        "김천시",
        "문경시",
        "봉화군",
        "상주시",
        "성주군",
        "안동시",
        "영덕군",
        "영양군",
        "영주시",
        "영천시",
        "예천군",
        "울릉군",
        "울진군",
        "의성군",
        "청도군",
        "청송군",
        "칠곡군",
        "포항시"
      ]
    },
    "gyeongsangnam-do": {
      "name": "경상남도",
      "areas": [
        "거제시",
        "거창군",
        "고성군",
        "김해시",
        "남해군",
        "밀양시",
        "사천시",
        "산청군",
        "양산시",
        "의령군",
        "진주시",
        "창녕군",
        "창원시",
        "통영시",
        "하동군",
        "함안군",
        "함양군",
        "합천군"
      ]
    },
    "jeju": {
      "name": "제주특별자치도",
      "areas": [
        "제주시",
        "서귀포시",
        "애월읍",
        "조천읍",
        "한림읍",
        "남원읍",
        "표선면",
        "한경면",
        "구좌읍",
        "성산읍",
        "대정읍",
        "중문동"
      ]
    }

  };

  for (var key in regionData.keys) {
    await FirebaseFirestore.instance
        .collection('region_sets')
        .doc(key)
        .set(regionData[key]!);
  }
}